//**************************************************************
//
// フェード
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _MODE_FADE_H_
#define _MODE_FADE_H_

//==============================================================
// include
//==============================================================
#include "fade.h"

//==============================================================
// 前方宣言
//==============================================================
class  CMotion;

//==============================================================
// フェードクラス
//==============================================================
class CModeFade : public CFade
{

public:
	CModeFade();
	~CModeFade();

	static CModeFade* Create();
	void NextMode(CApplication::MODE nextMode);
private:
	void Change() override;
private:
	CApplication::MODE m_nextMode;
};
#endif