//**************************************************************
//
// 戦いの祭壇
// Author : 梶田大夢
//
//**************************************************************
#ifndef _STATUE_COMBAT_H_			// このマクロ定義がされてなかったら
#define _STATUE_COMBAT_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "statue.h"

//==============================================================
// マクロ宣言
//==============================================================

//==============================================================
// 前方宣言
//==============================================================
class CPlayer;
class CCollisionBox;
class CCollisionCylinder;

//==============================================================
// 敵クラス
//==============================================================
class CStatueCombat : public CStatue
{
public:
	// コンストラクタとデストラクタ
	explicit CStatueCombat();
	~CStatueCombat();

	//プロトタイプ宣言
	HRESULT	Init() override;

	bool Select(CCharacter* selectCharacter) override;

	// 静的メンバ関数
	static CStatueCombat *Create(D3DXVECTOR3 pos);			// 生成

private:	// メンバ変数
};
#endif

