//**************************************************************
//
// がしゃどころ
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _GASYADOKURO_H_			// このマクロ定義がされてなかったら
#define _GASYADOKURO_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CGasyadokuro : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CGasyadokuro();
	~CGasyadokuro();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif