//**************************************************************
//
// 河童
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _KAPPA_H_			// このマクロ定義がされてなかったら
#define _KAPPA_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CKappa : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CKappa();
	~CKappa();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif