//**************************************************************
//
// 骸骨
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _SKELTON_H_			// このマクロ定義がされてなかったら
#define _SKELTON_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CSkelton : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CSkelton();
	~CSkelton();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif