//**************************************************************
//
// ゲーム画面(デバッグ)のヘッダー
// Author:梶田大夢
//
//**************************************************************
#ifndef _DEBUG_MODE_H_		//このマクロが定義されてなかったら
#define _DEBUG_MODE_H_		//2重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "mode.h"

//==============================================================
// マクロ宣言
//==============================================================

//==============================================================
// 前方宣言
//==============================================================
class CPlayerManager;
class CEnemyManager;
class CCameraGame;
class CLight;

//==============================================================
// デバッグモードクラス
//==============================================================
class CDebugMode : public CMode
{
public:
	CDebugMode();
	~CDebugMode();

	HRESULT Init() override;
	void Uninit() override;
	void Update() override;

	CCameraGame* GetCamera() { return m_camera; }
private:
	CPlayerManager* m_player;	// プレイヤー
	CEnemyManager* m_enemy;		// 敵
	CCameraGame* m_camera;
	CLight* m_light;
};
#endif
