//**************************************************************
//
// デュラハン
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _DULLAHAN_H_			// このマクロ定義がされてなかったら
#define _DULLAHAN_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CDullahan : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CDullahan();
	~CDullahan();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif