//**************************************************************
//
// 敵
// Author : 梶田大夢
//
//**************************************************************

// include
#include "enemy.h"
#include "Controller.h"
#include "application.h"
#include "objectX.h"

//--------------------------------------------------------------
// コンストラクタ
//--------------------------------------------------------------
CEnemy::CEnemy(int nPriority)
{

}

//--------------------------------------------------------------
// デストラクタ
//--------------------------------------------------------------
CEnemy::~CEnemy()
{

}

//--------------------------------------------------------------
// 初期化処理
//--------------------------------------------------------------
HRESULT CEnemy::Init()
{
	CCharacter::Init();

	return S_OK;
}

//--------------------------------------------------------------
// 終了処理
//--------------------------------------------------------------
void CEnemy::Uninit(void)
{
	CCharacter::Uninit();
}

//--------------------------------------------------------------
// 更新処理
//--------------------------------------------------------------
void CEnemy::Update(void)
{
	// 座標更新
	Updatepos();

	CCharacter::Update();

#ifdef _DEBUG
	CDebugProc::Print("Enemy：pos(%f,%f,%f)\n", m_pos.x, m_pos.y, m_pos.z);
	CDebugProc::Print("Enemy：move(%f,%f,%f)\n", m_move.x, m_move.y, m_move.z);
#endif // _DEBUG
}

//--------------------------------------------------------------
// 描画処理
//--------------------------------------------------------------
void CEnemy::Draw(void)
{
	CCharacter::Draw();
}

//--------------------------------------------------------------
// 生成
//--------------------------------------------------------------
CEnemy* CEnemy::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot)
{
	CEnemy* pEnemy;
	pEnemy = new CEnemy(CObject::ENEMY);
	pEnemy->m_pos = pos;
	pEnemy->m_rot = rot;
	pEnemy->Init();

	return pEnemy;
}

//--------------------------------------------------------------
// 座標の更新
//--------------------------------------------------------------
void CEnemy::Updatepos()
{
	m_move = D3DXVECTOR3(0.0f,0.0f,0.0f);

	m_posold = m_pos;	// 前回の位置の保存
	m_pos += m_move;	// 位置の更新

	SetPos(m_pos);
}