//**************************************************************
//
// ゲーム画面のヘッダー
// Author:Hamada Ryuuga
//
//**************************************************************
#ifndef _GAME_H_		//このマクロが定義されてなかったら
#define _GAME_H_		//2重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "mode.h"

//==============================================================
// マクロ宣言
//==============================================================
#define MAX_PLAYER	(1)

//==============================================================
// 前方宣言
//==============================================================
class CPlayer;
class CCamera;
class CLight;

//==============================================================
// ゲームクラス
//==============================================================
class CGame : public CMode
{
public:
	CGame();
	~CGame();

	HRESULT Init() override;
	void Uninit() override;
	void Update() override;

private:
	CPlayer* m_player[MAX_PLAYER];	// プレイヤー
	CCamera* m_camera;
	CLight* m_light;
};
#endif