//**************************************************************
//
// 牛鬼
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _GYUUKI_H_			// このマクロ定義がされてなかったら
#define _GYUUKI_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CGyuuki : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CGyuuki();
	~CGyuuki();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif