//**************************************************************
//
// item_model
// Author: Buriya Kota
//
//**************************************************************

//==============================================================
// include
//==============================================================
#include "item_model.h"
#include "item_manager.h"

//--------------------------------------------------------------
// コンストラクタ
//--------------------------------------------------------------
CItemModel::CItemModel(CTaskGroup::EPriority list) :
	m_modelData{
	"BOX", }
{
}

//--------------------------------------------------------------
// デストラクタ
//--------------------------------------------------------------
CItemModel::~CItemModel()
{
}

//--------------------------------------------------------------
// 初期化
//--------------------------------------------------------------
HRESULT CItemModel::Init()
{
	return S_OK;
}

//--------------------------------------------------------------
// 初期化(オーバーロード)
//--------------------------------------------------------------
HRESULT CItemModel::Init(int inId)
{
	LoadModel(m_modelData[inId]);

	return S_OK;
}

//--------------------------------------------------------------
// 生成
//--------------------------------------------------------------
CItemModel* CItemModel::Create(const D3DXVECTOR3& inPos, int inId)
{
	CItemModel* pItemModel = nullptr;
	pItemModel = new CItemModel;

	if (pItemModel != nullptr)
	{
		pItemModel->Init(inId);
		pItemModel->SetPos(inPos);
	}

	return pItemModel;
}
