//**************************************************************
//
// item_data.h
// Author : Buriya HIROHITO
// 
//**************************************************************
#ifndef _ITEM_DATA_
#define _ITEM_DATA_

//==============================================================
// —ñ‹“Œ^’è‹`
//==============================================================
enum ITEM_TYPE
{
	ITEM_NONE = -1,
	ITEM_POWER_UP,
	ITEM_POWER_ON,
	ITEM_POWER_TO,
	ITEM_MAX
};

#endif	// _ITEM_DATA_
