//**************************************************************
//
// item_manager
// Author: Buriya Kota
//
//**************************************************************

//==============================================================
// include
//==============================================================
#include "item_manager.h"

#include "item.h"
#include "item_model.h"

//==============================================================
// 静的メンバ変数宣言
//==============================================================
CItemManager* CItemManager::m_itemManager = nullptr;

//--------------------------------------------------------------
// インスタンス
//--------------------------------------------------------------
CItemManager* CItemManager::GetInstance()
{
	if (m_itemManager == nullptr)
	{
		m_itemManager = new CItemManager;
	}
	return m_itemManager;
}

//--------------------------------------------------------------
// コンストラクタ
//--------------------------------------------------------------
CItemManager::CItemManager(CTaskGroup::EPriority list) : 
	m_itemData(nullptr), m_itemType(ITEM_NONE)
{
	m_itemModel.clear();
}

//--------------------------------------------------------------
// デストラクタ
//--------------------------------------------------------------
CItemManager::~CItemManager()
{
}

//--------------------------------------------------------------
// 初期化
//--------------------------------------------------------------
HRESULT CItemManager::Init()
{
	return S_OK;
}

//--------------------------------------------------------------
// 終了
//--------------------------------------------------------------
void CItemManager::Uninit()
{
	m_itemData = nullptr;
	m_itemModel.clear();
}

//--------------------------------------------------------------
// 更新
//--------------------------------------------------------------
void CItemManager::Update()
{
}

//--------------------------------------------------------------
// 描画
//--------------------------------------------------------------
void CItemManager::Draw()
{
}

//--------------------------------------------------------------
// 生成
//--------------------------------------------------------------
void CItemManager::CreateItem(const D3DXVECTOR3& inPos, ITEM_TYPE inId)
{
	m_itemType = inId;

	switch (m_itemType)
	{
	case ITEM_POWER_UP:
		m_itemData = CItem::Create(inId);
		m_itemModel.push_back(CItemModel::Create(inPos, inId));
		break;
	default:
		break;
	}
}
