//**************************************************************
//
// 唐傘
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _KARAKASA_H_			// このマクロ定義がされてなかったら
#define _KARAKASA_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CKarakasa : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CKarakasa();
	~CKarakasa();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif