//**************************************************************
//
// マップのヘッダー
// Author:Tomidokoro Tomoki
//
//**************************************************************
#ifndef _MAP_H_		//このマクロが定義されてなかったら
#define _MAP_H_		//2重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "task.h"

//==============================================================
// マクロ宣言
//==============================================================

//==============================================================
// 前方宣言
//==============================================================
class CMesh;
class CObjectX;

//==============================================================
// マップクラス
//==============================================================
class CMap : public CTask
{
public:
	CMap();
	~CMap();

	HRESULT Init() override;
	void Uninit() override;
	void Update() override;

	// 静的メンバ関数
	static CMap *Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot);			// マップの生成

private:
	std::vector<CObjectX*> m_apModels;
	std::vector<CMesh*> m_apMesh;

	D3DXVECTOR3 m_pos;
	D3DXVECTOR3 m_rot;
};
#endif