//**************************************************************
//
// 近接攻撃
// Author : 梶田大夢
//
//**************************************************************
#ifndef _MELEE_ATTACK_H_	// このマクロ定義がされてなかったら
#define _MELEE_ATTACK_H_	// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "object.h"

//==============================================================
// マクロ宣言
//==============================================================

//==============================================================
// 前方宣言
//==============================================================
class CCharacter;
class CCollision;

//==============================================================
// 近接攻撃のクラス
//==============================================================
class  CMeleeAttack : public CObject
{
public:
	static CMeleeAttack *Create(D3DXVECTOR3 pos);

	CMeleeAttack();
	~CMeleeAttack() override;

	HRESULT Init() override;
	void Uninit() override;
	void Update() override;
	void Draw() override;

private:
	int m_life;
	bool m_ispenetration;
	CCollision*		m_collision;
};

#endif
