//**************************************************************
//
// 化け物
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _MONSTER_H_			// このマクロ定義がされてなかったら
#define _MONSTER_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CMonster : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CMonster();
	~CMonster();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif