//**************************************************************
//
// ぬりかべ
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _NURIKABE_H_			// このマクロ定義がされてなかったら
#define _NURIKABE_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CNurikabe : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CNurikabe();
	~CNurikabe();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif