//**************************************************************
//
// 鬼
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _ONI_H_			// このマクロ定義がされてなかったら
#define _ONI_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class COni : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit COni();
	~COni();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif