//**************************************************************
//
// 選択されてるObjectによって動作行動を教えるUI
// Author : Yuda Kaito
//
//**************************************************************

//==============================================================
// include
//==============================================================
#include "select_ui.h"
#include "application.h"
// 描画物
#include "object2d.h"
#include "text_object.h"

//==============================================================
// 定数
//==============================================================

//--------------------------------------------------------------
// コンストラクタ
//--------------------------------------------------------------
CSelectUI::CSelectUI(CTaskGroup::EPriority list) :
	m_text(nullptr)
{
}

//--------------------------------------------------------------
// デストラクタ
//--------------------------------------------------------------
CSelectUI::~CSelectUI()
{
}

//--------------------------------------------------------------
// 初期化
//--------------------------------------------------------------
HRESULT CSelectUI::Init()
{
	CObject::Init();
	m_pos = D3DXVECTOR3(SCREEN_WIDTH - 310.0f, CApplication::CENTER_POS.y + 100.0f, 0.0f);

	m_ground = CObject2d::Create(CTaskGroup::LEVEL_2D_UI);
	m_ground->SetPos(m_pos);
	m_ground->SetSize(D3DXVECTOR3(120.0f, 15.0f, 0.0f));
	m_ground->SetColor(D3DXCOLOR(0.0f, 0.0f, 0.0f, 0.15f));
	SetEndChildren(m_ground);

	return S_OK;
}

//--------------------------------------------------------------
// 更新
//--------------------------------------------------------------
void CSelectUI::Update()
{
}

//--------------------------------------------------------------
// 文字の登録
//--------------------------------------------------------------
void CSelectUI::SetText(std::string inText)
{
	assert(m_text == nullptr);

	D3DXVECTOR3 textPos = m_pos + D3DXVECTOR3(-100.0f, 0.0f, 0.0f);
	m_text = CText::Create(textPos, D3DXVECTOR3(7.5f, 7.5f, 0.0f), 0, 0, inText.c_str());
	SetEndChildren(m_text);
}

