//**************************************************************
//
// スキル
// Author : 髙野馨將
//
//**************************************************************
#ifndef _SKILLENTITY_H_			// このマクロ定義がされてなかったら
#define _SKILLENTITY_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "skill.h"

//==============================================================
// 前方宣言
//==============================================================
class CCharacter;

//==============================================================
// スキルクラス
//==============================================================
class CSkillEntity : public CSkill
{
public:
	// コンストラクタとデストラクタ
	explicit CSkillEntity(int nPriority = 3);
	~CSkillEntity();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Uninit() override;
	void	Update() override;

	// 静的メンバ関数
	static CSkillEntity *Create(D3DXVECTOR3 pos);			// スキルの生成

private:		// メンバ変数
	CCharacter*		m_apChara;				// キャラクターのインスタンス
	int				m_ID[MAX_SKILL];		// スキルID
};
#endif