//**************************************************************
//
// スキル
// Author : 髙野馨將
//
//**************************************************************
#ifndef _SKILL_H_			// このマクロ定義がされてなかったら
#define _SKILL_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "task.h"

//==============================================================
// マクロ宣言
//==============================================================
#define MAX_SKILL		(4)
#define MAX_SKILL_TYPE	(1)

//==============================================================
// 前方宣言
//==============================================================
class CCharacter;

//==============================================================
// スキルクラス
//==============================================================
class CSkill : public CTask
{
public:
	// コンストラクタとデストラクタ
	explicit CSkill(int nPriority = 3);
	~CSkill();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Uninit() override;
	void	Update() override;

	// 静的メンバ関数
	static CSkill *YamatoSkill(std::string tag, CCharacter *chara);				// スキルの生成

private:		// メンバ変数
	CCharacter*		m_apChara;				// キャラクターのインスタンス
	int				m_ID;					// スキルID
	int				m_CT[MAX_SKILL];		// クールタイム
	std::string		m_Name;					// スキル名
};
#endif