//**************************************************************
//
// スキル
// Author : 髙野馨將
//
//**************************************************************
#ifndef _SKILL_H_			// このマクロ定義がされてなかったら
#define _SKILL_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "task.h"

//==============================================================
// 前方宣言
//==============================================================
class CCharacter;

//==============================================================
// スキルクラス
//==============================================================
class CSkill : public CTask
{
public:
	// コンストラクタとデストラクタ
	explicit CSkill(int nPriority = 3);
	~CSkill();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Uninit() override;
	void	Update() override;

private:		// メンバ変数
	std::vector<CCharacter*>		m_apChara;		// キャラクターのインスタンス
};
#endif