//**************************************************************
//
// スキル(リキャスト)
// Author : 髙野馨將
//
//**************************************************************
#ifndef _SKILL5_H_			// このマクロ定義がされてなかったら
#define _SKILL5_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "skill_entity.h"

//==============================================================
// 前方宣言
//==============================================================
class CCharacter;
class CCollision;

//==============================================================
// スキルクラス
//==============================================================
class CSkill5 : public CSkillEntity
{
public:
	// コンストラクタとデストラクタ
	explicit CSkill5();
	~CSkill5();

	// 静的メンバ関数
	static CSkill5* Create(CCharacter* chara);		// スキルの生成

	void InitAbility() override;					// スキルが始まるとき
	void AllWayAbility() override {}				// スキル中
	void HitAbility(CCharacter* Target) override;	// スキルが当たった時の効果

private:		// メンバ変数

};
#endif