//**************************************************************
//
// 宝箱の祭壇
// Author : 梶田大夢
//
//**************************************************************
#ifndef _STATUE_CHEST_H_			// このマクロ定義がされてなかったら
#define _STATUE_CHEST_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "statue.h"

//==============================================================
// マクロ宣言
//==============================================================

//==============================================================
// 前方宣言
//==============================================================
class CPlayer;
class CCollisionBox;
class CCollisionCylinder;

//==============================================================
// 敵クラス
//==============================================================
class CStatueChest : public CStatue
{
public:
	// コンストラクタとデストラクタ
	explicit CStatueChest(int nPriority = 3);
	~CStatueChest();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Uninit() override;
	void	Update() override;

	// 静的メンバ関数
	static CStatueChest *Create(D3DXVECTOR3 pos);			// 宝箱の祭壇の生成

private:	// メンバ変数
	bool m_bOnce;
};
#endif

