//**************************************************************
//
// 天狗(小)
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _TENGU_CHILD_H_			// このマクロ定義がされてなかったら
#define _TENGU_CHILD_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CTenguChild : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CTenguChild();
	~CTenguChild();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif