//**************************************************************
//
// 天狗
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _TENGU_H_			// このマクロ定義がされてなかったら
#define _TENGU_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CTengu : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CTengu();
	~CTengu();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif