//**************************************************************
//
// きつね
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _FOX_H_			// このマクロ定義がされてなかったら
#define _FOX_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CFox : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CFox();
	~CFox();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif