//**************************************************************
//
// 九尾
// Author : Yuda Kaito
//
//**************************************************************
#ifndef _NINE_FOX_H_			// このマクロ定義がされてなかったら
#define _NINE_FOX_H_			// 二重インクルード防止のマクロ定義

//==============================================================
// include
//==============================================================
#include "enemy.h"

//==============================================================
// 敵クラス
//==============================================================
class CNineFox : public CEnemy
{
public:
	// コンストラクタとデストラクタ
	explicit CNineFox();
	~CNineFox();

	//プロトタイプ宣言
	HRESULT	Init() override;
	void	Update() override;

private:
	void Move() override;		// 移動
};
#endif